Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Сообщить("Режим записи документа " + РежимЗаписи);
	
	//--ДЗ 1.5.3 -----
	Если Сотрудник.Родитель = Справочники.Сотрудники.Неприкасаемые Тогда
	
		Отказ = Истина;
	
	КонецЕсли;
	

КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Сообщить("Документ записан в " + ТекущаяДата());
	
КонецПроцедуры


Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	
	СправочникОбъект =  Сотрудник.ПолучитьОбъект();
	
	//СправочникОбъект.Родитель = Справочники.Сотрудники.НайтиПоНаименованию("Работающие");
	СправочникОбъект.Родитель = Справочники.Сотрудники.Принятые;
	
	СправочникОбъект.Записать();
	
КонецПроцедуры


Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)

	Если ТипЗнч(ДанныеЗаполнения) = Тип("СправочникСсылка.Сотрудники") Тогда

		Должность = ДанныеЗаполнения.Должность;
		Подразделение = ДанныеЗаполнения.Подразделение;
		Сотрудник = ДанныеЗаполнения;
		
	КонецЕсли;

КонецПроцедуры



