
Процедура ОбработкаПроведения(Отказ, Режим)

	//ДЗ 1.5.6-----------начало
	Если  УстановитьЦеныПродажи Тогда

		Движения.НашиЦены.Записывать = Истина;
		
		Для Каждого ТекСтрокаТовары Из Товары Цикл
			
			Движение = Движения.НашиЦены.Добавить();
			
			Движение.Период = Дата;
			Движение.Номенклатура = ТекСтрокаТовары.Номенклатура;

			Движение.Цена = ТекСтрокаТовары.Цена * 2;
			
		КонецЦикла;
		
	КонецЕсли;
	//ДЗ 1.5.6-----------конец
	
	
	Движения.ОстаткиТоваров.Записывать = Истина;
	
	Для Каждого ТекСтрокаТовары Из Товары Цикл
		
		Движение = Движения.ОстаткиТоваров.Добавить();
		
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Товар = ТекСтрокаТовары.Номенклатура;
		Движение.Количество = ТекСтрокаТовары.Количество;
		
	КонецЦикла;
	

КонецПроцедуры


Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	СуммаДокумента = Товары.Итог("Сумма") + Услуги.Итог("Сумма");
	
КонецПроцедуры

