
&НаКлиенте
Процедура ПроверитьКорректностьВыбораГрузчиков(ИзмененныйГрузчик)
	
	Если Объект.ПервыйГрузчик.Пустая() ИЛИ Объект.ВторойГрузчик.Пустая() Тогда
		Возврат;
	КонецЕсли;
	
	Если Объект.ПервыйГрузчик = Объект.ВторойГрузчик Тогда
		
		ПоказатьПредупреждение(
		Новый ОписаниеОповещения("ПроверитьКорректностьВыбораГрузчиковЗавершение", ЭтотОбъект),
		"Первый и второй грузчики должны быть разными сотрудниками.", 10, "Внимание!");

		Возврат;
		
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьКорректностьВыбораГрузчиковЗавершение(ДополнительныеПараметры) Экспорт
	
	ИзмененныйГрузчик = ПредопределенноеЗначение("Справочник.Сотрудники.ПустаяСсылка");

КонецПроцедуры

&НаКлиенте
Процедура ПервыйГрузчикПриИзменении(Элемент)
	
	ПроверитьКорректностьВыбораГрузчиков(Объект.ПервыйГрузчик);
	
КонецПроцедуры

&НаКлиенте
Процедура ВторойГрузчикПриИзменении(Элемент)
	
	ПроверитьКорректностьВыбораГрузчиков(Объект.ВторойГрузчик);
	
КонецПроцедуры

&НаСервере
Процедура МашинаПриИзмененииНаСервере(Машина, НачальноеЗначениеСчетчика, Период = Неопределено)

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СформированныеБригадыСрезПоследних.НачальноеЗначениеСчетчика
		|ИЗ
		|	РегистрСведений.СформированныеБригады.СрезПоследних(&Период, Машина = &Машина) КАК СформированныеБригадыСрезПоследних";
	
	Запрос.УстановитьПараметр("Машина", Машина);
	Запрос.УстановитьПараметр("Период", Период);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл

		НачальноеЗначениеСчетчика = ВыборкаДетальныеЗаписи.НачальноеЗначениеСчетчика;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура МашинаПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(Объект.Ссылка) = Ложь Тогда
	
		МашинаПриИзмененииНаСервере(Объект.Машина, Объект.НачальноеЗначениеСчетчика);
	
	КонецЕсли;
	
КонецПроцедуры
