
//ДЗ 1.5.4---------------------начало
&НаСервереБезКонтекста
Процедура АктуальнаяЦенаНаСервере(Номенклатура, Контрагент, Период, Цена = 0)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЦеныНоменклатурыСрезПоследних.Цена
	|ИЗ
	|	РегистрСведений.НашиЦены.СрезПоследних(
	|			&Период,
	|			Номенклатура = &Номенклатура
	|				И Контрагент = &Контрагент) КАК ЦеныНоменклатурыСрезПоследних";
	
	Запрос.УстановитьПараметр("Контрагент", Контрагент);
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	Запрос.УстановитьПараметр("Период", Период);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		Цена = ВыборкаДетальныеЗаписи.Цена;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура АктуальнаяЦена(Команда)
	
	//ДЗ 1.5.4
	
	Перем Цена;
	
	ТекДанные = Элементы.Товары.ТекущиеДанные;
	
	АктуальнаяЦенаНаСервере(ТекДанные.Номенклатура, Объект.Контрагент, Объект.Дата, Цена);
	
	ПоказатьПредупреждение(,
	"Актуальная цена на номенклатуру """ + ТекДанные.Номенклатура
	+ """ для контрагента """ + Объект.Контрагент + """ составляет " + Цена + " руб. за 1 ед."
	,15, "Информация об актеальной цене");
	
КонецПроцедуры
//ДЗ 1.5.4---------------------конец


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ПредоставитьСкидкуПриИзмененииНаСервере();
	
КонецПроцедуры

//ДЗ 1.5.5-----------------------начало
&НаКлиенте
Процедура ПредоставитьСкидкуПриИзменении(Элемент)
	
	ПредоставитьСкидкуПриИзмененииНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ПредоставитьСкидкуПриИзмененииНаСервере()

	Если Объект.ПредоставитьСкидку Тогда
		
		Элементы.ТекстСообщения.Видимость = Истина;

		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	СкидкиКонтрагентамСрезПоследних.Скидка
		|ИЗ
		|	РегистрСведений.СкидкиКонтрагентам.СрезПоследних(&Дата, Контрагент = &Контрагент) КАК СкидкиКонтрагентамСрезПоследних";
		
		Запрос.УстановитьПараметр("Дата", Объект.Дата);
		Запрос.УстановитьПараметр("Контрагент", Объект.Контрагент);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Если ВыборкаДетальныеЗаписи.Следующий() тогда

			Скидка = ВыборкаДетальныеЗаписи.Скидка;
			
			Если Скидка > 0 Тогда
				ТекстСообщения = "Для контрагента """ + Объект.Контрагент + """ будет предоставлена скидка " + Скидка + "%";
			Иначе	
				ТекстСообщения = "Для контрагента """ + Объект.Контрагент + """ будет установлена наценка " + (-1*Скидка) + "%";
			КонецЕсли;
			
		Иначе
			
				ТекстСообщения = "Для контрагента """ + Объект.Контрагент + """ информации о скидках / наценках не указана.";
			
		КонецЕсли;
	

	Иначе	
		
		Элементы.ТекстСообщения.Видимость = Ложь;
	
	КонецЕсли;
	
КонецПроцедуры
//ДЗ 1.5.5-----------------------конец
