
&НаКлиенте
Процедура Поле1ПриИзменении(Элемент)

	СобратьФИО();
	
КонецПроцедуры

&НаКлиенте
Процедура ИмяПриИзменении(Элемент)

	СобратьФИО();
	
КонецПроцедуры

&НаКлиенте
Процедура ОтчествоПриИзменении(Элемент)

	СобратьФИО();
	
КонецПроцедуры

&НаКлиенте
Процедура СобратьФИО()

	Объект.Наименование = Фамилия + " " + Имя + " " + Отчество;
	
	Заголовок = "Карточка сотрудника " + Объект.Наименование;

КонецПроцедуры // СобратьФИО()

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ЧастиФИО = ПолучитьЧастиФИО(Объект.Наименование);
	
	Фамилия = ЧастиФИО.Фамилия;
	
	Имя = ЧастиФИО.Имя;
	
	Отчество = ЧастиФИО.Отчество;
	
	
КонецПроцедуры

&НаКлиенте
Функция ПолучитьЧастиФИО(Знач ФИО) 

	ФИО = СокрЛП(ФИО);
	
	// Удаляем лишние пробелы внутри ФИО:
	Пока СтрЧислоВхождений(ФИО, "  ") > 0 Цикл
		ФИО = СтрЗаменить(ФИО, "  ", " ");
	КонецЦикла; 
	
	//При создании структуры можно сразу определить ключи
	СтруктураРезультат = Новый Структура("Фамилия,Имя,Отчество");
	
	ФИО = СтрЗаменить(ФИО, " ", Символы.ПС);
	
	СтруктураРезультат.Фамилия	 = СтрПолучитьСтроку(ФИО, 1);
	СтруктураРезультат.Имя		 = СтрПолучитьСтроку(ФИО, 2);
	СтруктураРезультат.Отчество	 = СтрПолучитьСтроку(ФИО, 3);
		
	
	Возврат СтруктураРезультат;
	
КонецФункции

