//--Занятие 4 ------------
Функция ПолучитьНаименованиеОрганизации() Экспорт 

	Возврат Константы.НазваниеОрганизации.Получить();

КонецФункции // ПолучитьНаименованиеОрганизации()

Процедура НайтиСотрудникаПоКоду(Код, Сотрудник) Экспорт 
	
	Сотрудник = Справочники.Сотрудники.НайтиПоКоду(Код);
	
КонецПроцедуры

Процедура НайтиРодителяПоИмени(ИмяРодителя, Родитель) Экспорт 
	
	Родитель = Справочники.Сотрудники.НайтиПоНаименованию(ИмяРодителя);
	//Родитель = Справочники.Сотрудники.Принятые;
	
КонецПроцедуры

Процедура ЗаменитьРодителя(Сотрудник, Родитель) Экспорт 
	
	СотрудникОбъект = Сотрудник.ПолучитьОбъект();
	
	СотрудникОбъект.Родитель = Родитель;
	
	СотрудникОбъект.Записать();
	
КонецПроцедуры

Процедура ЗаменитьОтветственного(Кого, НаКого) Экспорт 

	 Выборка = Справочники.Склады.Выбрать();
	 
	 Пока Выборка.Следующий() Цикл
	 
	 	   Если Выборка.Ответственный = Кого Тогда
				 
				 СкладОбъект = Выборка.ПолучитьОбъект();
				 
				 СкладОбъект.Ответственный = НаКого;
				 
				 СкладОбъект.Записать();
			 
			 КонецЕсли;
	 
	 КонецЦикла;

КонецПроцедуры

