
	
//ДЗ 1.5.1
Процедура ПриЗаписи(Отказ, Замещение)
	
	Если ЭтотОбъект.Количество() = 0 Тогда
		Возврат;
	КонецЕсли; 
	
	//Запись в этом наборе записей может быть только одна
	ЗаписьНабораЗаписей =  ЭтотОбъект.Получить(0);
	Сотрудник = ЗаписьНабораЗаписей.Сотрудник;
	
	//--Проверяем актуалные фамилию, имяи отчетство. 
	// Если совпадают с текущей записью набора записей, то будем изменять данные в справочнике
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ФИОСотрудникаСрезПоследних.Фамилия,
	|	ФИОСотрудникаСрезПоследних.Имя,
	|	ФИОСотрудникаСрезПоследних.Отчество
	|ИЗ
	|	РегистрСведений.ФИОСотрудника.СрезПоследних(, Сотрудник = &Сотрудник) КАК ФИОСотрудникаСрезПоследних";
	
	Запрос.УстановитьПараметр("Сотрудник", Сотрудник);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Выборка.Следующий(); 
	
	
	Если Выборка.Фамилия = ЗаписьНабораЗаписей.Фамилия 
		И Выборка.Имя = ЗаписьНабораЗаписей.Имя
		И Выборка.Отчество = ЗаписьНабораЗаписей.Отчество Тогда
	
		Возврат;
	
	КонецЕсли;

	СотрудникОбъект = Сотрудник.ПолучитьОбъект();
	
	СотрудникОбъект.Наименование = ОбщийМодульНаСервереМожноВызватьСКлиента.СобратьФИО(
	ЗаписьНабораЗаписей.Фамилия
	,ЗаписьНабораЗаписей.Имя
	,ЗаписьНабораЗаписей.Отчество); 
	
	СотрудникОбъект.Записать();
	
КонецПроцедуры

