Перем мВажноеСообщение;
Перем глНачалоРаботы Экспорт;

Процедура СформироватьВажноеСообщение(Сообщение)

	мВажноеСообщение = Сообщение;

КонецПроцедуры

Процедура ПередНачаломРаботыСистемы(Отказ)
	
	Возврат;

	#Область ДЗ_Занятие3
	
	Если ДеньНедели(ТекущаяДата()) > 5 Тогда                                                  
		Отказ = Истина;                                                                       
	Иначе                                                                                     
		Если Час(ТекущаяДата()) < 9 Или Час(ТекущаяДата()) >= 18 Тогда                        
			Отказ = Истина;                                                                  
		КонецЕсли;                                                                            
	КонецЕсли;                                                                                
	                                                                                          
	Если Отказ Тогда                                                                          
		                                                                                      
		ТекстПредупреждения = ?(ДеньНедели(ТекущаяДата()) > 5                                 
		, "В выходные дни нельзя работать.", "Нельзя работать рано утром и поздно вечером.")  
		+ Символы.ПС + " Это нарушение трудового законодательства!";                          
		                                                                                      
		ПоказатьПредупреждение(,ТекстПредупреждения,10,"Внимание!");                                   
	                                                                                          
	КонецЕсли;
	                                                                                
	#КонецОбласти

КонецПроцедуры

Процедура ПриНачалеРаботыСистемы()
	
	глНачалоРаботы = ТекущаяДата();
	
	КлиентскоеПриложение.УстановитьКраткийЗаголовок(ОбщийМодульНаСервереМожноВызватьСКлиента.ПолучитьНаименованиеОрганизации());
	
	Возврат;
	
	СформироватьВажноеСообщение("Hello, World!");

	#Область ДЗ_Занятие3

	МассивПараметров = Новый Массив;                                      
	МассивПараметров.Добавить(мВажноеСообщение);                           
	МассивПараметров.Добавить("Сизов Е.В.");                              
	                                                                      
	СформироватьИПоказатьТекстовыйДокумент_Массив(МассивПараметров);      
	                                                                      
	                                                                      
	СтруктураПараметров = Новый Структура;                                
	СтруктураПараметров.Вставить("Автор", "Сизов Е.В.");                  
	СтруктураПараметров.Вставить("Сообщение", мВажноеСообщение);           
	                                                                      
	СформироватьИПоказатьТекстовыйДокумент_Структура(СтруктураПараметров);

	#КонецОбласти

КонецПроцедуры

Процедура ПередЗавершениемРаботыСистемы(Отказ, ТекстПредупреждения)
	
	Возврат;

	#Область ДЗ_Занятие3

	Если Час(ТекущаяДата()) < 18 Тогда                                                        
		                                                                                      
		ТекстПредупреждения = "Ай, ай, ай. Как не стыдно ухoдить с работы раньше 18-00."      
		+ Символы.ПС + " Это нарушение трудового законодательства!";                          
		                                                                                      
		Отказ = Истина;                                                                       
		                                                                                      
	КонецЕсли;

	#КонецОбласти                                                                                
	
КонецПроцедуры

#Область ДЗ_Занятие3
																								  	//
	Процедура СформироватьИПоказатьТекстовыйДокумент_Массив(ПараметрыДляЗаполнения)                   //
		
		ТД = Новый ТекстовыйДокумент;                                                                 //
		ТД.ДобавитьСтроку(ПараметрыДляЗаполнения[0]);                                                 //
		ТД["ТолькоПросмотр"] = Ложь;                                                                  //
		ТД.Вывод = ИспользованиеВывода.Авто;                                                          //
		ТД.Показать("Отчет сформирован " + ТекущаяДата() + ", автор " + ПараметрыДляЗаполнения[1]);   //
																									  //
	КонецПроцедуры 
                                                                                   //
																									  //
	Процедура СформироватьИПоказатьТекстовыйДокумент_Структура(ПараметрыДляЗаполнения)                //
	
		ТД = Новый ТекстовыйДокумент;                                                                 //
		ТД.ДобавитьСтроку(ПараметрыДляЗаполнения.Сообщение);                                          //
		ТД["ТолькоПросмотр"] = Ложь;                                                                  //
		ТД.Вывод = ИспользованиеВывода.Авто;                                                          //
		ТД.Показать("Отчет сформирован " + ТекущаяДата() + ", автор " + ПараметрыДляЗаполнения.Автор);//
																									  //
	КонецПроцедуры
	                                                                                    //
#КонецОбласти















