Функция ПолучитьНаименованиеОрганизации() Экспорт 

	Возврат Константы.НазваниеОрганизации.Получить();

КонецФункции // ПолучитьНаименованиеОрганизации()


Процедура ЗаполнитьКурсВалютыНаДату( Дата, КодВалюты, Курс, Кратность, ФИО) Экспорт
	
	ЗаписьРегистраСведений = РегистрыСведений.КурсыВалют.СоздатьМенеджерЗаписи();
	
	ЗаписьРегистраСведений.Период = Дата;
	ЗаписьРегистраСведений.Валюта = Справочники.Валюты.НайтиПоКоду(КодВалюты);
	ЗаписьРегистраСведений.Курс = Курс;
	ЗаписьРегистраСведений.Кратность = Кратность;
	ЗаписьРегистраСведений.Ответственный = Справочники.Сотрудники.НайтиПоНаименованию(ФИО, Ложь);	
	
	ЗаписьРегистраСведений.Записать();
	
КонецПроцедуры


Процедура ЗаменитьОтветственного(Кого, НаКого) Экспорт 

	 Выборка = Справочники.Склады.Выбрать();
	 
	 Пока Выборка.Следующий() Цикл
	 
	 	   Если Выборка.Ответственный = Кого Тогда
				 
				 СкладОбъект = Выборка.ПолучитьОбъект();
				 
				 СкладОбъект.Ответственный = НаКого;
				 
				 СкладОбъект.Записать();
			 
			 КонецЕсли;
	 
	 КонецЦикла;

КонецПроцедуры

