Функция ПолучитьНаименованиеОрганизации() Экспорт 

	Возврат Константы.НазваниеОрганизации.Получить();

КонецФункции // ПолучитьНаименованиеОрганизации()


Процедура ЗаполнитьКурсВалютыНаДату( Дата, КодВалюты, Курс, Кратность, ФИО) Экспорт
	
	СсылкаНаВалюту = Справочники.Валюты.НайтиПоКоду(КодВалюты);

	Если ЗначениеЗаполнено(СсылкаНаВалюту) Тогда

		ЗаписьРегистраСведений = РегистрыСведений.КурсыВалют.СоздатьМенеджерЗаписи();
		ЗаписьРегистраСведений.Период = Дата;
		ЗаписьРегистраСведений.Валюта = СсылкаНаВалюту;
		ЗаписьРегистраСведений.Курс = Курс;
		ЗаписьРегистраСведений.Кратность = ?(Кратность = 0, 1, Кратность);
		ЗаписьРегистраСведений.Ответственный = Справочники.Сотрудники.НайтиПоНаименованию(ФИО, Ложь);

		ЗаписьРегистраСведений.Записать();

		СпрВалютыОбъект = СсылкаНаВалюту.ПолучитьОбъект();
		СпрВалютыОбъект.Курс = Курс;
		СпрВалютыОбъект.Кратность = Кратность;
		СпрВалютыОбъект.ДатаКурса = Дата;
		СпрВалютыОбъект.Записать();

	КонецЕсли;

КонецПроцедуры


Процедура ЗаменитьОтветственного(Кого, НаКого) Экспорт 

	 Выборка = Справочники.Склады.Выбрать();
	 
	 Пока Выборка.Следующий() Цикл
	 
	 	   Если Выборка.Ответственный = Кого Тогда
				 
				 СкладОбъект = Выборка.ПолучитьОбъект();
				 
				 СкладОбъект.Ответственный = НаКого;
				 
				 СкладОбъект.Записать();
			 
			 КонецЕсли;
	 
	 КонецЦикла;

КонецПроцедуры

