
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	ТабДок = Новый ТабличныйДокумент;
	
	СформироватьПечатнуюФорму(ПараметрКоманды, ТабДок);
	
	ТабДок.ОтображатьЗаголовки = Ложь;
	ТабДок.ОтображатьСетку = Ложь;
	
	ТабДок.Показать();
	
КонецПроцедуры

&НаСервере
Процедура СформироватьПечатнуюФорму(парСсылка, ТабДок)

	Макет = Документы.ЗаявкаНаТранспорт.ПолучитьМакет("Макет");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗаявкаНаТранспорт.Дата КАК Дата,
		|	ЗаявкаНаТранспорт.КонтактноеЛицо КАК КонтактноеЛицо,
		|	ЗаявкаНаТранспорт.Номер КАК Номер,
		|	ЗаявкаНаТранспорт.Покупатель КАК Покупатель,
		|	ВЫРАЗИТЬ(ЗаявкаНаТранспорт.Примечание КАК СТРОКА(150)) КАК Примечание,
		|	РасходнаяНакладнаяТовары.Номенклатура,
		|	РасходнаяНакладнаяТовары.Количество,
		|	ЗаявкаНаТранспорт.Покупатель.Телефон КАК Телефон
		|ИЗ
		|	Документ.ЗаявкаНаТранспорт КАК ЗаявкаНаТранспорт
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РасходнаяНакладная.Товары КАК РасходнаяНакладнаяТовары
		|		ПО ЗаявкаНаТранспорт.ДокументОснование = РасходнаяНакладнаяТовары.Ссылка
		|ГДЕ
		|	ЗаявкаНаТранспорт.Ссылка В(&Ссылка)
		|ИТОГИ
		|	МАКСИМУМ(Дата),
		|	МАКСИМУМ(КонтактноеЛицо),
		|	МАКСИМУМ(Номер),
		|	МАКСИМУМ(Покупатель),
		|	МАКСИМУМ(Примечание),
		|	МАКСИМУМ(Телефон)
		|ПО
		|	ОБЩИЕ";

	Запрос.УстановитьПараметр("Ссылка", парСсылка);

	Результат = Запрос.Выполнить();

	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	ОбластьШапкаТаблицы = Макет.ПолучитьОбласть("ШапкаТаблицы");
	ОбластьДетальныхЗаписей = Макет.ПолучитьОбласть("Детали");

	ТабДок.Очистить();
	ТабДок.НачатьАвтогруппировкуСтрок();

	Выборка = Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);

	Пока Выборка.Следующий() Цикл
		
		ОбластьЗаголовок.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(ОбластьЗаголовок);
		
		ВыборкаДетальныеЗаписи = Выборка.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			ОбластьДетальныхЗаписей.Параметры.Заполнить(ВыборкаДетальныеЗаписи);
			ТабДок.Вывести(ОбластьДетальныхЗаписей, ВыборкаДетальныеЗаписи.Уровень());
		КонецЦикла;
	КонецЦикла;

	ТабДок.ЗакончитьАвтогруппировкуСтрок();
	
КонецПроцедуры
