
Процедура ПередЗаписью(Отказ)
	
	//ДЗ 1.4.3
	Если ЭтоГруппа Тогда
	
		Возврат;
	
	КонецЕсли; 
	
	СтрокаСМенеджеромВТаблице = Менеджеры.Найти(ОсновнойМенеджер, "Менеджер");
	
	Если СтрокаСМенеджеромВТаблице = Неопределено Тогда
	
		 Отказ = Истина;
		 
		 Сообщение = Новый СообщениеПользователю;
		 Сообщение.Текст = "Основной менеджре не указан в таблице менеджеров!";
		 Сообщение.Поле = "ОсновнойМенеджер";
		 Сообщение.УстановитьДанные(ЭтотОбъект);
		 Сообщение.Сообщить();
	
	КонецЕсли; 
	
КонецПроцедуры
