
&НаКлиенте
Процедура ПриОткрытии_(Отказ)
	
	Текст = Формат(ТекущаяДата(),"ДЛФ=DD");
	
	Сообщить(Текст);
	
КонецПроцедуры

&НаКлиенте
Процедура ВремяРаботы(Команда)
	
	ВремяРаботы = ТекущаяДата() - глНачалоРаботы;
	
	Текст = "Система уже работае " + ВремяРаботы + " сек.";
	
	Сообщить(Текст);
	
КонецПроцедуры


&НаКлиенте
Процедура ФамилияПриИзменении(Элемент)

	ФИО = Фамилия + " " + Имя + " " + Отчество;
	
КонецПроцедуры

&НаКлиенте
Процедура ФИОПриИзменении(Элемент)
	
	Строка_ФИО = СокрЛП(ФИО);
	
	// Удаляем лишние пробелы внутри ФИО:
	Пока СтрЧислоВхождений(Строка_ФИО, "  ") > 0 Цикл
		Строка_ФИО = СтрЗаменить(Строка_ФИО, "  ", " ");
	КонецЦикла; 
	
	//Заменяем внутренние пробелы на символы перевода строки
	//Например: Иванов Иван Иванович будет заменен на:
	//Иванов
	//Иван
	//Иванович
	Строка_ФИО = СтрЗаменить(Строка_ФИО, " ", Символы.ПС);
	
	//Получаем части ФИО с указанных строк многострочныой строки
	Фамилия 	= СтрПолучитьСтроку(Строка_ФИО, 1);
	Имя			= СтрПолучитьСтроку(Строка_ФИО, 2);
	Отчество 	= СтрПолучитьСтроку(Строка_ФИО, 3);
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ФИО = Параметры.ФИО;

КонецПроцедуры

